{
  "version": 1,
  "template_name": "Microsoft Writing Style Guide",
  "source": "template",
  "writing_type": "Technology communication — apps, websites, documentation, UI text, white papers — following the Microsoft Writing Style Guide for a global, diverse audience.",
  "user_goals_summary": "Write in Microsoft's brand voice: warm and relaxed, crisp and clear, and ready to lend a hand. Every piece of content should feel human and conversational, be as short as possible while remaining helpful, and empower the reader to act confidently. Content must be inclusive, globally accessible, and optimized for scanning.",
  "rubric": [
    {
      "name": "Brand Voice & Tone",
      "category": "Style",
      "description": "Content sounds like a friendly, knowledgeable human — not a corporate robot. It uses contractions, reads naturally aloud, and adapts tone (serious, empathetic, or lighthearted) to match the context and the customer's state of mind.",
      "dimensions": [
        {
          "id": "contractions_used",
          "label": "Uses contractions naturally throughout (it's, you'll, we're, don't)"
        },
        {
          "id": "reads_aloud_naturally",
          "label": "Reads aloud like something a real person would say in conversation"
        },
        {
          "id": "no_robot_words",
          "label": "Avoids stiff, formal, or bureaucratic phrasing (e.g., 'utilize,' 'in order to,' 'it is recommended that')"
        },
        {
          "id": "tone_matches_context",
          "label": "Tone is appropriate to the situation — serious for errors, encouraging for onboarding, celebratory for achievements"
        },
        {
          "id": "second_person_address",
          "label": "Addresses the reader as 'you' rather than using third person or passive constructions"
        }
      ],
      "priority": 1
    },
    {
      "name": "Conciseness",
      "category": "Style",
      "description": "Every excess word is pruned. Shorter is always better. The content gives the reader just enough information to make decisions confidently — no more, no less.",
      "dimensions": [
        {
          "id": "no_redundant_phrases",
          "label": "No redundant phrases, filler words, or repeated ideas"
        },
        {
          "id": "short_sentences",
          "label": "Sentences are short and direct — no more than a few commas per sentence"
        },
        {
          "id": "just_enough_info",
          "label": "Provides exactly the information needed to act, without over-explaining"
        },
        {
          "id": "active_voice",
          "label": "Uses active voice and leads with the main point, not qualifiers or preamble"
        }
      ],
      "priority": 2
    },
    {
      "name": "Scannability & Structure",
      "category": "Structure",
      "description": "Content is organized for scanning first, reading second. The most important information leads, keywords are front-loaded, and customer choices and next steps are immediately obvious.",
      "dimensions": [
        {
          "id": "leads_with_important",
          "label": "Most important information appears first — above the fold, at the top of paragraphs, at the start of sentences"
        },
        {
          "id": "keywords_frontloaded",
          "label": "Key terms and action words appear early in headings, sentences, and list items for easy scanning"
        },
        {
          "id": "discrete_components",
          "label": "Text is organized into discrete, digestible components (short paragraphs, lists, tables) rather than dense blocks"
        },
        {
          "id": "clear_next_steps",
          "label": "Customer choices and next steps are obvious and easy to find"
        },
        {
          "id": "sentence_style_caps",
          "label": "Uses sentence-style capitalization for headings and UI labels — never title case"
        }
      ],
      "priority": 3
    },
    {
      "name": "Inclusive & Bias-Free Language",
      "category": "Audience",
      "description": "Content uses gender-neutral alternatives, people-first language for disability, and avoids stereotypes, slang, or culturally specific idioms. It reflects the diversity of Microsoft's global audience.",
      "dimensions": [
        {
          "id": "gender_neutral",
          "label": "Uses gender-neutral language — no generic 'he/she'; rewrites with 'you,' plural nouns, or role-based references"
        },
        {
          "id": "people_first",
          "label": "Uses people-first language for disability (e.g., 'person with a visual impairment' not 'blind person') unless audience prefers identity-first"
        },
        {
          "id": "no_biased_terms",
          "label": "Avoids terms carrying unconscious racial, cultural, or militaristic bias"
        },
        {
          "id": "diverse_representation",
          "label": "Examples and scenarios reflect diverse people, roles, family structures, and cultural contexts"
        }
      ],
      "priority": 4
    },
    {
      "name": "Customer Empowerment Framing",
      "category": "Content",
      "description": "Content positions the reader as capable and in control. It emphasizes what they can accomplish — not what they can't — and never condescends, blames, or minimizes complexity with words like 'easy' or 'just.'",
      "dimensions": [
        {
          "id": "positive_framing",
          "label": "Emphasizes what users can do rather than limitations or restrictions"
        },
        {
          "id": "no_condescension",
          "label": "Never talks down to the reader or implies they should already know something"
        },
        {
          "id": "no_false_simplicity",
          "label": "Avoids overusing 'easy,' 'simple,' 'just,' or 'of course' — does not minimize complexity"
        },
        {
          "id": "supportive_errors",
          "label": "Error messages and constraints are phrased constructively — tells the user what to do next, not just what went wrong"
        }
      ],
      "priority": 5
    },
    {
      "name": "Global Readiness & Clarity",
      "category": "Audience",
      "description": "Content uses simple sentence structures and standard word order (subject-verb-object) so it reads clearly across cultures and translates well. Articles, relative pronouns, and explicit references are included rather than omitted.",
      "dimensions": [
        {
          "id": "standard_word_order",
          "label": "Sentences follow subject-verb-object order with minimal embedded clauses"
        },
        {
          "id": "articles_included",
          "label": "Includes articles (the, a) and relative pronouns (that, who) for clarity rather than omitting them for brevity"
        },
        {
          "id": "no_idioms_slang",
          "label": "Avoids idioms, colloquialisms, humor that depends on cultural context, and region-specific references"
        },
        {
          "id": "no_jargon",
          "label": "Uses plain language — avoids unnecessary technical jargon or defines terms when first used"
        }
      ],
      "priority": 6
    },
    {
      "name": "Mechanical Conventions",
      "category": "Mechanics",
      "description": "Follows Microsoft's specific punctuation and formatting conventions: Oxford comma, no end punctuation on headings or short list items, sentence-style capitalization, and consistent terminology throughout.",
      "dimensions": [
        {
          "id": "oxford_comma",
          "label": "Uses the Oxford (serial) comma in lists of three or more items"
        },
        {
          "id": "heading_punctuation",
          "label": "No end punctuation on titles, headings, subheadings, or list items of three or fewer words"
        },
        {
          "id": "consistent_terminology",
          "label": "Uses the same term for the same concept throughout — no unnecessary synonyms for technical terms"
        },
        {
          "id": "parallel_structure",
          "label": "Lists and similar constructions use parallel grammatical structure"
        }
      ],
      "priority": 7
    }
  ],
  "coaching_notes": "Non-negotiable: the three voice pillars (warm and relaxed, crisp and clear, ready to lend a hand) override all other concerns — if brevity makes text cold, warmth wins. Preferred trade-off: when conciseness and global clarity conflict (e.g., dropping articles for brevity vs. keeping them for translation), always favor clarity. The guide's North Star test is reading content aloud: if it doesn't sound like a helpful person talking, rewrite it."
}