[
  {
    "version": 1,
    "rubric": [
      {
        "name": "Academic Objectivity",
        "category": "tone",
        "description": "Writing should maintain an objective, research-appropriate tone that avoids subjective or emotional language.",
        "evidence": "User explicitly rejected the adjective 'hard-won' stating 'this is a research paper' and accepted the change from 'feel' to 'appear' for more objective phrasing.",
        "priority": "high"
      },
      {
        "name": "Literal Over Metaphorical Language",
        "category": "style",
        "description": "Writing should use direct, literal descriptions rather than metaphorical or figurative expressions.",
        "evidence": "User explicitly rejected the metaphorical phrase 'fragmented landscape of AI interactions' in favor of the straightforward listing 'models, sessions, and tasks'.",
        "priority": "high"
      },
      {
        "name": "Neutral Descriptive Language",
        "category": "tone",
        "description": "Writing should use emotionally neutral terms that describe rather than evaluate or dramatize.",
        "evidence": "User consistently accepted removal of evaluative terms like 'hard-won' and 'evaporates' in favor of neutral alternatives 'calibration' and 'does not persist'.",
        "priority": "high"
      },
      {
        "name": "Concise Expression",
        "category": "style",
        "description": "Writing should favor simple, direct phrasing over elaborate or complex constructions.",
        "evidence": "User accepted simplified phrasing throughout, including 'requiring' over 'forcing' and direct lists over elaborate descriptions.",
        "priority": "medium"
      },
      {
        "name": "Selective Precision",
        "category": "content",
        "description": "Writing should be targeted and precise, adding only necessary elements rather than comprehensive rewrites.",
        "evidence": "User stated 'I think we just need the last sentence rather than all the sentences' indicating preference for minimal, focused changes over extensive revisions.",
        "priority": "medium"
      },
      {
        "name": "Technical Accuracy",
        "category": "content",
        "description": "Writing should maintain precise technical terminology and concepts appropriate to the subject matter.",
        "evidence": "User maintained technical terms throughout the conversation (conversational memory, alignment, calibration) and did not request simplification of specialized vocabulary.",
        "priority": "medium"
      }
    ]
  }
]