{
  "version": 1,
  "writing_type": "Persuasive grant proposal paragraph",
  "user_goals_summary": "Create compelling, evidence-based grant proposal content that demonstrates impact while maintaining professional tone and accessibility for diverse reviewers.",
  "rubric": [
    {
      "name": "Evidence-Based Impact",
      "category": "Content",
      "description": "Uses specific, quantifiable data and concrete examples to demonstrate impact. Avoids vague claims and emotional appeals.",
      "exemplary": "Every claim is supported by specific data points (percentages, numbers, timeframes). Zero vague quantifiers like 'many' or 'significant'. All statistics include source/context. Impact is demonstrated through concrete, measurable outcomes (e.g., '23% reduction in X' not 'major improvement').",
      "proficient": "90%+ of claims backed by specific data. May have 1-2 minor instances of imprecise language but these don't appear in key impact statements. Most outcomes quantified with clear metrics.",
      "developing": "50-70% of claims have specific supporting data. 3-5 instances of vague quantifiers or unsupported claims. Some key impact areas lack concrete evidence.",
      "beginning": "Less than 50% of claims supported by specific data. Multiple vague or emotional appeals. Impact statements lack quantification. Would require substantial addition of evidence.",
      "weight": 35
    },
    {
      "name": "Professional Tone & Accessibility",
      "category": "Style",
      "description": "Maintains formal, objective tone while remaining accessible to non-expert reviewers. Balances technical accuracy with readability.",
      "exemplary": "Zero instances of informal language, contractions, or colloquialisms. All technical terms defined on first use. No jargon without context. Sentence structures vary but remain clear (15-25 words average). 100% of paragraphs have clear topic sentences.",
      "proficient": "Maintains professional tone in 95%+ of content. May have 1 minor instance of informal phrasing. Technical terms generally defined. Most sentences clear and well-structured.",
      "developing": "Professional tone in 70-80% of content. 2-4 instances of informal language or undefined jargon. Some sentences overly complex or unclear. Some paragraphs lack clear structure.",
      "beginning": "Multiple instances of informal language, undefined jargon, or unclear technical explanations. Tone inconsistent. Would require significant revision for professional grant context.",
      "weight": 25
    },
    {
      "name": "Logical Structure & Flow",
      "category": "Structure",
      "description": "Presents information in a clear, logical progression. Each sentence builds on the previous. Transitions make relationships explicit.",
      "exemplary": "Every sentence has explicit logical connection to previous (causal, sequential, elaborative). Zero topic jumps. Problem-solution or cause-effect relationships clearly signaled with transition language. Reader can follow argument without re-reading.",
      "proficient": "90%+ of sentences have clear logical connection. May have 1 implicit connection that's still followable. Problem-solution relationship present and generally clear.",
      "developing": "60-80% of sentences clearly connected. 2-3 instances where reader must infer connection. Some ideas feel disconnected or out of sequence.",
      "beginning": "Less than 60% of sentences clearly connected. Multiple topic jumps. Logical progression unclear. Reader must work to follow the argument.",
      "weight": 20
    },
    {
      "name": "Conciseness & Precision",
      "category": "Style",
      "description": "Every word serves a purpose. Eliminates redundancy and vague language. Uses specific, concrete terms.",
      "exemplary": "Zero redundant phrases or repeated ideas. No vague terms like 'various', 'numerous', 'things'. Could not be shortened by more than 5% without losing content. All noun phrases specific and concrete.",
      "proficient": "Minor redundancy (1-2 phrases could be consolidated). 95%+ of language precise. Could be shortened by 5-10% but maintains clarity.",
      "developing": "Notable redundancy (3-4 repeated concepts). Multiple vague terms present. Could be shortened by 20-30% without losing core content.",
      "beginning": "Significant redundancy throughout. Frequent vague language. Could be shortened by 40%+ without content loss. Verbosity obscures main points.",
      "weight": 20
    }
  ],
  "weighting_rationale": "Evidence-Based Impact (35%) is weighted highest as grant proposals fundamentally succeed or fail on demonstrated outcomes. Professional Tone & Accessibility (25%) is critical for diverse review panels. Structure (20%) and Conciseness (20%) are essential but serve the primary goal of conveying impact.",
  "coaching_notes": "This rubric emphasizes quantifiable evidence and professional clarity. The user values data-driven narratives over emotional appeals. Focus on making every claim concrete and measurable. Transitions should explicitly signal logical relationships rather than rely on reader inference."
}
