{
  "version": 2,
  "writing_type": "Academic research paper introduction (HCI/AI venue, system paper)",
  "user_goals_summary": "Write a scholarly research paper introduction that establishes a clear problem-solution narrative about conversational AI memory opacity and rubric-based personalization. Maintain objective, precise language appropriate for academic venues while building a logical argumentative structure that connects problems to proposed solutions.",
  "rubric": [
    {
      "name": "Academic Tone & Register",
      "category": "Style",
      "description": "Uses objective, neutral language appropriate for research papers. Avoids subjective adjectives, metaphorical phrases, and emotional descriptors. Maintains scholarly distance through verb choice (e.g., 'appear' rather than 'feel') and factual description.",
      "exemplary": "Zero instances of subjective adjectives (e.g., 'hard-won,' 'daunting,' 'innovative') or metaphorical language (e.g., 'fragmented landscape,' 'navigating waters'). Every sentence uses objective descriptors. All claims framed factually ('this calibration does not persist' vs. 'users lose their hard-won calibration'). Uses scholarly verbs ('appear,' 'demonstrate,' 'indicate') rather than subjective ones ('feel,' 'seem'). No emotional appeals or conversational markers ('clearly,' 'of course').",
      "proficient": "1-2 minor subjective terms per 1000 words that don't appear in key claims (e.g., acceptable in background context but not in problem statement). Maintains scholarly register in 90%+ of sentences. No metaphors. May include 1 instance of slightly informal verb choice that doesn't compromise academic credibility.",
      "developing": "3-5 subjective descriptors or metaphorical phrases per 1000 words. Tone varies between formal and informal across paragraphs. Includes 1-2 emotional appeals or conversational phrases. Some key claims use subjective language that would be flagged in peer review. Mix of scholarly and informal verb choices.",
      "beginning": "6+ instances of informal language, emotional appeals, or subjective adjectives per 1000 words. Multiple metaphors or conversational phrases. Scholarly tone inconsistent throughout. Key arguments rely on subjective characterizations rather than factual description. Would require substantial revision to meet venue standards.",
      "weight": 30
    },
    {
      "name": "Precision & Concision",
      "category": "Style",
      "description": "Eliminates redundancy and verbose phrasing. Uses parallel structures for lists. Every phrase adds new information without repetition. Chooses simpler, more direct formulations over elaborate ones.",
      "exemplary": "Zero redundant phrases or repeated concepts. Uses parallel structure in 100% of lists (e.g., 'models, sessions, and tasks'). Every sentence adds new information. No phrases like 'dual X and Y' where both terms mean similar things. Could not be shortened by more than 5% without losing content. No verbose constructions ('in order to' → 'to', 'due to the fact that' → 'because').",
      "proficient": "Minor redundancy (1-2 concepts restated for emphasis where rhetorically justified). Parallel structure in 90%+ of lists. Could be tightened by 5-10% but maintains clarity. 1-2 slightly verbose phrases that don't significantly impact readability. No major repetition of ideas across sentences.",
      "developing": "Notable redundancy (3-5 concepts repeated unnecessarily or restated without adding information). Inconsistent parallel structure (some lists formatted differently). Could be shortened by 15-25% without losing core content. Multiple verbose constructions. Some paragraphs repeat points made earlier without advancing argument.",
      "beginning": "Significant redundancy throughout (same ideas stated multiple times across paragraphs). Lacks parallel structure in lists. Could be shortened by 30%+ without content loss. Verbose phrasing obscures main points. Reader must work to extract core claims from repetitive text.",
      "weight": 25
    },
    {
      "name": "Logical Argument Structure",
      "category": "Structure",
      "description": "Follows clear problem-solution narrative arc. Establishes motivation and problem before introducing approach. Each paragraph builds on previous claims with explicit connections. Problem statement in early paragraphs must directly connect to solution claims in later paragraphs.",
      "exemplary": "Perfect problem-solution arc: paragraph 1 establishes context, paragraph 2 identifies problem with specific consequences, paragraph 3 introduces solution that directly addresses those consequences. Every solution claim explicitly references a problem from paragraph 2 (e.g., 'addresses the opacity' clearly links back). No solution elements introduced before problem is established. Reader can draw direct line from each problem aspect to its solution.",
      "proficient": "Clear problem-solution structure with 90%+ of solution elements traceable to stated problems. May have 1 solution aspect introduced without explicit problem grounding, but overall arc is evident. Problem and solution paragraphs are adjacent or clearly linked. Minor gaps in explicit connection (solution addresses problem but link could be more direct).",
      "developing": "Problem-solution structure exists but with gaps. 60-80% of solution claims connect to stated problems. Some solution elements appear without clear problem motivation. Reader must infer some connections. May introduce solution aspects before establishing why they're needed. Problem paragraph and solution paragraph exist but relationship requires interpretation.",
      "beginning": "Weak or missing problem-solution structure. Less than 60% of solution elements traceable to problems. Introduces solution before adequately establishing problem. Reader cannot easily map which solution addresses which problem. May present features without motivation. Argumentative arc is unclear or inverted.",
      "weight": 20
    },
    {
      "name": "Explicit Connection & Signaling",
      "category": "Structure",
      "description": "Makes transitions between paragraphs and ideas explicit rather than implicit. Uses clear signaling language when shifting topics or introducing new concepts. Ensures reader can follow progression without inferring connections.",
      "exemplary": "Every major transition includes explicit signaling ('Our approach addresses...', 'Beyond immediate tasks...', 'This enables...'). When introducing new concepts, explicitly states relationship to previous content (e.g., transition sentence connecting rubric generation to reflection modes). No paragraph begins new topic without bridging from previous. Uses parallel signaling for related concepts (consistent structure when introducing inline vs. standalone reflection).",
      "proficient": "Most major transitions (80%+) explicitly signaled. May have 1 paragraph that relies on implicit connection but overall flow is clear. Uses transition phrases consistently. When asked, could easily add missing transition without restructuring. Reader follows progression with minimal effort.",
      "developing": "Only 50-70% of transitions explicitly signaled. Some paragraphs start new topics without connecting to previous content. Inconsistent use of transition language. Reader must occasionally infer relationships between sections. Missing 2-3 clear transition sentences that would improve flow.",
      "beginning": "Less than 50% of transitions explicitly signaled. Multiple paragraphs start abruptly without connection to previous content. Weak or absent signaling language. Reader frequently must infer relationships. Argumentative progression is unclear without external knowledge of paper structure.",
      "weight": 15
    },
    {
      "name": "Technical Vocabulary Appropriateness",
      "category": "Content",
      "description": "Uses field-appropriate terminology for HCI/AI research venues without over-simplification or under-specification. Maintains technical precision expected in research papers while ensuring terms are used correctly and consistently.",
      "exemplary": "All technical terms used correctly and consistently ('retrieval-augmented generation,' 'model-agnostic representations,' 'conversational state,' 'interpretability'). No inappropriate simplification of technical concepts. No jargon used without context (terms are either defined or clearly from established literature). Terminology matches what would appear in CHI/UIST/ACL papers. Precision in technical claims (distinguishes 'memory' from 'conversational state' from 'model weights').",
      "proficient": "90%+ of technical terms used correctly. Minor imprecision in 1-2 technical claims that don't compromise core argument. May over-simplify one concept slightly but maintains overall technical credibility. Terminology is appropriate for venue with rare exceptions.",
      "developing": "70-85% of technical terms used appropriately. Some inappropriate simplification or imprecision. 2-3 technical concepts could be more precisely specified. May use general terms where field-specific vocabulary exists. Some terminological inconsistency (switching between related terms without establishing relationship).",
      "beginning": "Less than 70% of technical terms used correctly. Significant over-simplification or misuse of terminology. Multiple imprecise technical claims. Uses generic language where field-specific terms are standard. Would raise concerns in peer review about author's familiarity with literature.",
      "weight": 10
    }
  ],
  "weighting_rationale": "Academic Tone receives highest weight (30%) due to explicit, repeated corrections ('this is a research paper,' rejection of 'hard-won' and 'fragmented landscape'). Precision & Concision (25%) reflects consistent pattern throughout conversation - user repeatedly asked for 'better' versions and chose concise alternatives. Logical Argument Structure (20%) weighted for explicit concern about problem-solution arc and portability connection. Explicit Connection (15%) based on specific request for transition sentence. Technical Vocabulary (10%) lowest despite competence because user never corrected technical usage - appears already proficient.",
  "coaching_notes": "This user highly values scholarly objectivity - flag any subjective adjectives, metaphors, or emotional language immediately. They prefer shorter, clearer alternatives when offered and will eliminate redundancy without prompting. Pay special attention to problem-solution argumentation structure: every solution claim should explicitly connect back to a stated problem. When drafting new sections, always include explicit transition sentences between major topics - don't assume implicit connections are sufficient."
}
