[
  {
    "version": 1,
    "rubric": [
      {
        "name": "Technical Accuracy and Logical Relationships",
        "category": "accuracy",
        "description": "Technical concepts must be described accurately with correct logical relationships between ideas. Avoid presenting sequential or complementary processes as competing alternatives.",
        "evidence": "User corrected 'rubric generation versus RL fine-tuning' and insisted on accurate description of how rubrics capture what users value rather than domain constraints.",
        "priority": "high"
      },
      {
        "name": "Context-Appropriate Register",
        "category": "tone",
        "description": "Language should match the context—research writing requires academic terminology and framing rather than marketing or commercial language.",
        "evidence": "User explicitly rejected 'core innovation' stating 'This is my research project, not a product.'",
        "priority": "high"
      },
      {
        "name": "Emphasis Aligned with Core Purpose",
        "category": "focus",
        "description": "Writing should emphasize what genuinely matters to the user's goals rather than peripheral features, even if those features exist.",
        "evidence": "User redirected emphasis from 'ability to switch between models' to fine-tuning with LoRA using rubric-based reward functions for user alignment.",
        "priority": "high"
      },
      {
        "name": "Direct Communication",
        "category": "structure",
        "description": "Communicate ideas directly without unnecessary formulaic transitions or procedural framing phrases. Start with substance rather than meta-commentary.",
        "evidence": "User rejected 'The approach works as follows...' in favor of direct description of the system.",
        "priority": "medium"
      },
      {
        "name": "Precision in Terminology",
        "category": "accuracy",
        "description": "Use precisely the right terms and framings even when similar concepts might seem interchangeable. Small differences in meaning matter.",
        "evidence": "User corrected 'domain constraints' to 'what the user values in their writing' despite the concepts being related.",
        "priority": "medium"
      }
    ]
  }
]